// 模拟小说数据（章节和分页）

// 最原始最简单的版本 —— 用 text，不乱码、不分页、不报错
const novelData = [
    {
        title: "第一章 你果然有问题",
        text: `
一次普通的游戏后，杀手再次胜利，不过这已经不是什么新鲜事了，所有的求生者都已经对自己每天的死亡感到乏力了，他们一直在想尽办法保护自己

这次，在大厅昏暗的灯光下，shed，builderman和dusekker再一次聚在一起讨论起了现在的状况，他们三个在之前就立下了保护这里所有人的誓言，他们必须要面对这解不开的难题

不过现在他们在讨论的问题是刚刚对局里1x1的异常表现

builderman坐在椅子上，手指有一下没一下地敲着桌子，因为脚踩不到地上，于是晃来晃去 

“你们没有看到他下手和之前不一样了吗？”

builderman点出了这个事情，毕竟他也是见证过无数次1x1攻击招式的人，但这一次显然与之前的任何时候都不同

“虽然我也这样认为，不过这件事还是要看shed的理解，很显然他是接触1x1时间最长的”

dusekker慢悠悠地飘在旁边，轻轻拍了一下builderman的手不让他发出噪音，显然他不想轻易下结论，于是将这个话题转给了shed

shed坐在椅子上，用抹布擦着刚刚在对局里沾满灰尘的宝剑，抬头看了一眼：

“我吗？真是个好问题，我其实也发现了不对劲，毕竟我怎么可能不了解我自己写的底层程序的？”

说罢，便把宝剑轻轻靠在桌子上，

“你们不觉得他下手轻了很多吗？”

builderman无奈的看着shed，这感受也就只有shed能体会出来了吧。都是死，还被这家伙品出轻重来了

“你说的没错，我想到了一个方法，既然他的招式和行为出现了与以往不同的变化，就有很大可能是底层代码出现了问题，而能在forsaken里创造出这种问题的，或许就和specter有很大的关系了”

dusekker一边把手里的权杖放到一边，一边飘到了shed旁边分析道

“对哦——下次等他被击晕的时候我正好可以看看他出现什么漏洞了，没准还能查查是不是他脑子出问题了”

shed不急不慢的伸了个懒腰，贱兮兮地从身后掏出个鸡腿

“吃吗？”

“吃你妈”两人异口同声的反驳



“This round killer is——1x1x1x1”

来到熟悉的地图，shed叹了口气，随即又回复了平时的吊样

“本来还想拖一拖呢，我好困啊”

shed抱怨了两句后慢悠悠地去找电机了

好巧不巧的是，shed恰巧在路上碰上了1x1，1x1轻松的杀死了Elliot，又自顾自的慢慢走了起来。

shed无奈之下自己走了出来，把自己当作诱饵亮在1x1的视线范围内，不过奇怪的是1x1这次没有立刻冲过来，而像是丝毫不在意一样径直走了过来

“咦？这次他怎么…”

话音未落，1x1就在瞬间抽出带着错误数据流的双剑用力朝着shed的位置扔了过去，黑色的双剑在空中划出尖锐的破空声，重重地刺向shed的胸膛，顿时间鲜血晕染了白色的上衣

还没等shed反应过来，他整个人都被这双剑拽着往前飞，身体里异物对他肉体撕裂般的疼痛让他动弹不得，眼前看不清路，只有无数点不动的弹窗死死地挡在自己的眼前

不过shed对这个招式也习以为常了，他很快被双剑拖到了1x1的面前，捂着被割裂般疼痛的腹部缓冲

1x1没有立刻动手，他只是面无表情地，用一种极其粗暴的方式用手抓着shed的头发被迫让他直视自己的眼睛，红色的眼眸中看不清情绪，不断闪烁着红色的故障灯散发着令人发指的气息：

“这次主动来找我了？”

shed抬起头，喘着粗气，在与1x1对视的瞬间拔剑斩向了1x1，嘴上还不忘嘲讽两句，他身体上如同史莱姆般绿色的物质被剑刃划开，又迅速愈合

持续眩晕时，shed抓住这个时机打开了他的基础代码面板

……


“情感？！”

刚刚还嬉皮笑脸的shed愣在了原地，这是什么意思？难道说自己当年给1x1创造了情感？不应该啊，自己怎么不记得，当年只是想创造一个能够有能力与自己一战的人，一个能容纳自己所有仇恨的容器，但是自己从没有想过赋予他情感
这会怎么样？

这会对自己有什么影响？这会不会让他变得与以前不同？

更可怕的不是这个，更可怕的是，这就说明，1x1会意识到自己对他做的一切，他会意识到shed以自己身为“创造者”的身份却让自己成为了一个无情的杀戮机器

他会意识到自己的“创造者”永远要求自己做出非人的行为

……

当他意识到这些时，自己该怎么做？

眩晕结束后，见shed持久未动，1x1再次靠近了他：

“傻了？喂？”

挑了挑眉，但也不想多说些什么，毕竟他自己也察觉到了自己的异样，对于各种事物他似乎都有了自己的看法，而不单单是那个用仇恨所创造的容器了

也不知道是从什么时候有的，那些类似于人类的感官，对这个世界的认知好像都有所改变，当然还有对自己”父亲“的认知。

不过他自己也不想让别人察觉到这份异样，毕竟犹豫的越多，弱点就越明显。自己能怎么办，面前这个人像傻了一样愣在原地。这个时候趁虚而入是不是不太妥？

自己也不是什么小人，一刀，就捅一刀

“呲啦——”

这一刀到是提醒了shed自己该回神了，双剑上的数据流在自己的伤口上肆意侵蚀，伴随着刚刚被划开的伤口被感染的剧痛，还伴随着中毒的效果

从伤口渐入身体内部，像是灼烧了一样挥之不去的疼痛已经掩盖了刚刚被剑拉过来那时的撕裂感，这股疼痛感顺着血管伴随着感染流向大脑，大脑里像是有什么东西一直在催着自己赶紧离开

像是哭完后揉眼睛一样，眼前的一切也变得模糊起来，看不清前方的路，只好硬着头皮出于本能的往前跑，这几下可差点把自己的刚吃下去的鸡腿呕出来了

不过现在至少不是大肠从肚子里掉出来，既然没有，那就继续跑！

“果然打一下就好了，不中用的老东西”

1x1很明显对于shed就这么跑了的情况有些不满，不过他能做什么？当然是本能的，追上去！

“他果然还是没变啊......还是那么毫不留情” 

很快自己的体力值已经见底，他不得不停下脚步恢复体力。不过以1x1的老年速度一时半会还来不了，就先躲起来吧

`
    },
    {
        title: "第二章 你怎么不打了",
        text: `
时间很快就到了1分钟，也是和1x1的反常行为有很大的联系，因为一般来说，像他那种以杀人为目标的强大杀手基本上这个时候都要打到LMS了，但是这次基本上也没几个死的，shed还在观察1x1的状态。

“......真无聊”

1x1了无生趣的说着，看着自己剑上的血迹，倒影着自己模糊不清的脸，他的眼神中竟多了几分的低沉，变得没什么杀意了

抬起左手往后捋了捋刘海，不过白色的长发上也被手染上了斑斑血迹，虽然剑里的样子不是那么清楚，但自己还是注意到了头发上被染上的血迹，于是目光转移到了自己的手上

“......”

自己的手上什么时候有的这些血？

从一开始就有了吗？自己怎么从来没有察觉到过

“噫......这些幸存者的血真恶心”

1x1抱怨着，不忘甩甩手，这种杀了别人自己还看不惯别人的血的简直就是胡闹，他自己都明白，不过这无法打消他的嗜血本能：

“看来下一次游戏结束后要洗一下手”

抱怨完成，屠杀继续

很快，又到了1x1和shed的LMS环节，shed的伤已经好的差不多了，要不是自己好兄弟临死前给了自己一个医疗包，自己早没了。

不过两人都不是很想认真对待这场游戏呢

“吼吼，这是第几次冤家路窄了？又是我们的LMS，你还真愿意把我留到最后呢，儿子~”

shed像是嘲讽一般的对着1x1说，他已经足足一整天没有看到1x1被自己激怒了，心里痒痒的难受

shed等待着对方的回应，但是1x1只是轻轻笑了笑，看来冷处理才是最令人愤怒的嘲讽啊！

shed一看他只是笑了笑，心里倒是郁闷了：

“他怎么不骂回去，他怎么没骂回去，情感模块究竟把他怎么了，它把1x1怎么了啊！他不应该是又哭又闹又生气扛起刀就要冲过来说 ’shed！你找死！‘ 吗？！旮旯game里不是这么演的啊！”

像是心有灵犀一样，1x1好像也清楚shed心里在想什么

是啊，感情模块把自己怎么了，不过自己就是什么都不想说，这些话说不出口，他也不知道shed知道他有感情模块这件事，所以他只是尽力隐藏，他不希望别人看到他自己的变化，也不希望让自己看到，更何况是在自己死对头的面前

不过既然是心有灵犀，那shed肯定也感觉到了1x1这个死鸭子嘴硬的家伙肯定是怕我知道他有感情了这件事，那就陪他玩玩，假装不知道吧。

“！”

只见shed不知什么时候靠近了1x1一胳膊搭在他肩膀上，动作快速流利，让1x1还没反应过来，下了一激灵

“哟，难得被我吓着了？”

shed开着玩笑，剑也缓缓放下，其实自己不是那么想用这把剑伤害自己的造物的，他只是需要一个能与自己一战的人而已

虽然他是由自己的仇恨所造，虽然之前自己对待他的态度不是很好，但其实自己对他一直有一种复杂的感情，他和自己的关系是那么复杂

练剑是为了保护更多的人，当然，也包括他

“什么？你知不知道你在做什么！”

1x1一把拍开了shed的手，恶狠狠地说道。其实现在他心里不是那么讨厌shed了，但是对于他突然的亲近自己感到十分的意外，所以出于本能的回避

对于他自己来说，shed已经是他人生中最亲近的人了，不知怎么的，在有了情感后自己脑海里想到的第一个人就是shed，平时也不由自主地想要靠近shed

但是靠近自己死对头这种行为也太不对劲了吧！

“别这么紧张嘛，不过看你好像也没有要杀了我的意思，你也开始觉得这个游戏无聊了？”

shed开了一个很好的话题，让1x1放松了一点

“确实有些无聊了，杀死你们已经成为我无聊的每日任务了，可不么…”

1x1看向shed，不过注意到shed的表情像是在憋笑，又生硬的把头扭了回去

“有什么想和我说的吗？还是现在继续完成你的每日任务？”

shed开玩笑一般的对1x1说，自己倒要看看这个感情模块会促使1x1做出什么样的选择。

“......想聊就聊吧，到时候杀你也来得及”

1x1装作一副若无其事的样子，其实心里还蛮开心的，自己之前能得到和shed说话的机会可不多，现在有机会了，就聊聊吧。

”1x1，你最近过的怎么样？“

shed问的这个问题很简单，很好答，很好糊弄，这是一个经典的百年长谈，但是1x1没有回答上来，自己似乎说不出“太好了”，“棒极了”，或者“糟糕透顶”这些词了

在内心前所未有的复杂状态前，自己都忘了这个问题是来糊弄人的了，或者说只是不想糊弄...眼前这个人，所以因为这个问题而思考了很久。

“儿子？傻了？”

自己真没见过1x1这样子过，这很奇怪不是吗？前一秒还好好的人下一秒就愣在原地了。shed好像意识到了，1x1正在思考，他正在想一个词可以形容自己的感受，第一次告诉自己眼前的人自己的真实感受

不过他认为这个话题不用着急跳过，只是静静地坐在地上，在1x1刚想说什么的时候，游戏时间结束了

“幸存者获胜”

1x1第一次在面对shed的时候感受到自己的无能，自己怎么这么不会说话啊！不就是表达个心情怎么这么难，自己简直就是废物中的废物！

每个人被传送了回去

“怎么了，第一次见你输了后在这里焦虑，被虐惨了？”

John Doe本来也只是想安慰一下，不过这让1x1心情更糟糕了，John Doe明白自己好像问得不是时候，耸了耸肩，但还是继续说到：

“因为他？那个shedletsky？他长得还挺眼熟的，我觉得我好像在哪里见过，你认识他？”

“何止是认识...”

1x1也不愿隐瞒，不过再详细点，自己就说不清楚了，只好继续一贯的高冷来回应John Doe的这个棘手的问题。

另一边

“shed，你赢了？”

Dusakker在幸存者胜利提示音响起时第一时间过来找到了shed，手上还在给自己挑好看的皮肤，虽然shed还是保持着他对什么都毫不在意的贱笑，但是dusakker看出来了，他有心事

dusakker手里继续挑着皮肤，他知道shed需要一些空间，这就足够了，让shed以为自己丝毫不在意，好有个台阶下，这简直就是情商天花板。不过这件事情对shed来说更棘手，除了自己这两个好兄弟以外，没有人知道这件事情是shed做的

这件事情就是1x1

想起来管理员Telamon，真是一个久远的名字，他创造了一个高空剑斗场，有名，非常的受众人喜欢，而自己的剑术慢慢练的锋芒毕露，最后登峰造极，那是无数个剑师都想要登上的位置，“剑圣”

但是他后来怎么了？

那个管理员，当时的Telamon剑圣，为什么要创造一个活体容器？为什么自己创造出了一个让所有robloxians都陷入恐慌的杀戮机器？装着满腔仇恨，可以与自己战斗的活死人

只是为了能证明自己的强大就伤害了别人？
那活死人实验真的就人道了吗？
只是为了展现自己最强剑圣的身份就去冒着伤害别人的风险？
那他可真不像个剑圣啊

Telamon，说好的这剑是来保护别人的呢？



…



“不，现在，叫我shedletsky就好”

`
    },
    {
        title: "第三章 没有这回事",
        text: `
“你这家伙又在自言自语什么？”

builderman看见shed回来了，迈着腿小跑了过来

dusakker指了指自己的脑子，builderman啧了一声但也明白，关于shed的事什么都没说，只是嘟囔着：

“好吧好吧，现在我们可以去休息了，虽然这里连时间都没有显示，但我的身体告诉我我需要睡上一觉，晚安”

说完后就走开了

又到了几个小时的固定休息时间，shed回到了自己休息的小房间，这里和自己家比起来简直是糟糕透了，虽然没有很差的环境，设施也很全，但就是什么都没有，或者说是自己心里什么都没有罢了

一脚甩开鞋子，整个人像是刚被抢打中一样躺在床上，脸上没什么可笑的了，疲惫感一股脑地涌了上来，脑子开始回想起刚才这局发生的一切

1x1当时想说什么？

这种感觉真奇怪，明明自己之前都没有怎么理过他，每次听说有一个黑绿黑绿的人在肆意杀戮的传言时自己的第一感觉就是紧张，就是想逃，直到一起进到了forsaken，这次真的逃不掉了

可现在他好像有了不一样的东西，这个东西又像是好的，又像是一个巨大的灾难，自己的儿子，仇人，遗憾，仇恨，也是自己，拥有了一个更无法控制的东西

他在底层代码就是要杀死我，那他在知道我做了什么后会不会恨我，会不会对我失望

他本来也可以是一个好好活着的人，但是我把他变成了这样，自己简直不是人，可我只是想找个人和我练剑，我只是犯了一个小错误而已

对，是人都会犯错的...这没什么...




真的没什么吗？




“好，现在...停止思考！”

shed像是催命般的思绪硬生生把自己逼醒了，猛地从床上坐起，用手抓住自己乱糟糟的头发来捂住头

像是刚从河里被捞起来，背后的冷汗染湿了衣服，在一阵微风吹过，感受到凉意后，慢慢的自己的视线恢复了正常，呼吸平静了下来

回想起刚刚，自己怎么会突然多了这么多思考？而且都是和1x1有关，真的头痛的要死！

这时，自己的房门被敲响了，传来了builderman的声音：

“咳咳，shed，你要是睡不着我们一起在大厅坐一会？如果不想就算了”

这句话像是救命稻草一样被shed立刻接收到，立刻从疲惫的状态爬起来，穿好衣服后急匆匆地跑了过去。

“你们不是说困了吗，怎么过来找我了？”

shed又恢复了往常贱兮兮的笑，不过有好兄弟陪着的感觉真好。builderman轻咳了两声，像是在掩饰自己刚刚说的话，但是就这点小心思早就被看出来了

“那真是太谢谢你咯！”

shed微微低头贱兮兮的笑着说

这里的天一直都是黑的，所以作息颠倒错乱也是很寻常的事情，也会有其他幸存者睡不着半夜起来瞎晃悠，对于这件事大家似乎都习以为常了

幸存者大厅和杀手大厅是分开的，以免让一些幸存者PTSD大爆发，不过这两个大厅中其实有一个小通道可以联通，但大家都不敢轻举妄动，因为一旦被specter发现了，没人知道代价是什么

但有些人就是愿意冒这个险，比如007n7就是这个通道的常客，之前coolkidd过生日时他就悄悄过去，把礼物放下，或是去千叮咛万嘱咐noli要照顾好coolkidd

不过要说杀手来到幸存者区是真不常见

现在，我们看见了那个例外

他们三个围在篝火旁，听到了头顶有点动静

shed刚喝了一口水差点喷出来

“我靠！”

一双红色的眼睛正在悄咪咪地注视着shed，这双眼睛的主人就是1x1，1x1正倒着悬挂在公告板后一棵高树的树枝上

builderman和dussaker也发现了1x1，builderman急忙假装自己困了要去重睡，dussaker更是假装自己是盲人跟着builderman一起奔回住宿区

“那个南瓜头一直都是瞎子吗？”

1x1率先问了一个十分不着调的问题

该说不说，shed这下是真的睡意全无了，刚刚还闷闷的心情此时也瞬间消失

没敢直面1x1的眼睛，浑身僵硬的看着地面，明明在对局里时还一点事没有呢，现在自己怎么连看都不敢看他一眼了

“……”

见shed没说话，1x1从树杈上跳了下来，用了一个自认为很嫌弃的表情看着他，说到

“现在又不想回答我了，那局里你不是还说得很起劲吗？”

这句话像是在埋怨shed，shed听到只是句调侃后也逐渐平复自己的心情，又挂上了那副贱兮兮的样子调侃道

“还不是因为在那局里某些人因为一个我的小问题而思考了半天？怎么，那局里也没见你回答我啊~”

shed刚想再次把手搭在1x1肩膀上时，他躲开了

“你，你躲什么啊你” 

shed这句话慌了，结巴了一下，1x1用手轻轻捋了一下头发笑了笑，这证明了shed还是没有完全逃离有关自己的恐惧，只要自己做出点什么都会让他慌，只要自己刻意疏远就能一直吊着他……

不过事实上，1x1不想疏远他

“shed，我是来告诉你那个问题的答案的”

“哈？”

好吧，真是个合理的想法，1x1要是不说，shed可能都忘了

“我今天……还不错”

1x1说完后犹豫了一下自己说的对不对，不过他马上就后悔了，只见shed转过身去，捂着嘴，身体像是得帕金森了一样不停抽搐，时不时还发出点噗嗤的声音

“shed！你给我去死！”

1x1见到自己又被他嘲笑了心里气鼓鼓的，又有点后悔自己说了什么，好像这件事真的不是很重要，自己又说的这么庄重

他现在简直想找个地缝钻进去

“算了，就当没有这回事吧！”

1x1转身就想走

`
    },
    {
        title: "第四章 非正式接触（创作中）",
        text: `
“等等等——一下！”

shed见他要被气走了，一下抓住了1x1的披风，不过只是抓一下不要紧，要紧的是1x1本来心情就怪怪的，更是一个不注意一头栽在了地上

1x1心里简直糟糕极了，又尴尬又气愤地咬着牙冲着shed无能狂怒

看着摔在地上狼狈的1x1，shed总不能一直在旁边笑话他

于是，他向1x1伸手，人生中第一次，伸手为了扶他起来

1x1再次犹豫了，这次不是自己爬起来，而是有一个愿意拉自己起来的人，那个人还是shed，该死的，自己为什么一直在犹豫不决！

1x1的手比他的大脑快，其实手早就伸出来了，等着shed拉自己，这种自己之前以为是在训动物才有的表现，到如今，却正正好发生在了自己的身上

这种感觉像是一团乱麻，自己好像变弱小了，明明自己很讨厌弱小，明明自己不需要被扶起来

但是自己就是想被眼前这个人扶起来

“真是的…你还等着我来接你的手啊！”

shed想都没想就一把拉起了他，不过，好像力气使大了，1x1刚刚被拉起来还没反应过来就被shed一手拉近了距离

1x1在即将倒在shed怀里的前一刻以极快的速度抄出剑猛地插在了shed身后的公告板上，公告板随着剑的冲击力震了一下，才得以稳住了身形

但此时自己与shed的脸，已经到了两人同时吸一口气都能碰到的距离

……

谁敢动

两人的呼吸在瞬间乱成一团，只是感觉到对方的呼吸，听到对方的心跳，甚至能感觉到对方的体温

shed的心跳也不由自主地加速了起来

1x1的心跳其实跳得更快，虽然他自己也不清楚为什么会这样

但他知道，这种感觉是从来没有过的，甚至有点让人害怕的感觉
`
    }
];

let current = 1;

// 显示章节
function show() {
    let d = novelData[current - 1];
    let html = `<div class="title">${d.title}</div>`;
    let arr = d.text.split("\n");
    for (let t of arr) {
        let s = t.trim();
        if (s) html += `<p>${s}</p>`;
    }
    document.getElementById("content").innerHTML = html;
}

// 跳转章节
function go(num) {
    current = num;
    show();
    // 自动回到顶部 ← 就加了这一行！
    document.getElementById("content").scrollTop = 0;
}

// 初始显示第一章
show();